# Задание №1
l = input("Введите строку без пробелов: ")

if l == l[::-1]:
    print("yes")
else:
    print("no")