# Задание №1
# Запрашиваем у пользователя вид питомца, его возраст и кличку
вид = input("Введите вид питомца: ")
возраст = input("Введите возраст питомца: ")
кличка = input("Введите кличку питомца: ")

# Выводим все эти данные в одно предложение
print(f'Это {вид} по кличке "{кличка}". Возраст: {возраст} года.')