#Задание №2
# Запрашиваем этапы развития человека
print("Введите этапы развития человека по порядку:")
Australopithecus = input("Первый этап: ")
Homo_habilis = input("Второй этап: ")
Homo_erectus = input("Третий этап: ")
Homo_sapiens_neanderthalensis = input("Четвертый этап: ")
Homo_sapiens_sapiens = input("Пятый этап: ")

# Выводим этапы развития человека с разделителем "=>"
print(Australopithecus, Homo_habilis, Homo_erectus, Homo_sapiens_neanderthalensis, Homo_sapiens_sapiens, sep=' => ')
