# Задание №1
# Запрос сторон прямоугольника
a = float(input("Введите длину первой стороны прямоугольника: "))
b = float(input("Введите длину второй стороны прямоугольника: "))

# Вычисление площади и периметра
площадь = a * b
периметр = 2 * (a + b)

# Вывод результатов
print(f"Площадь прямоугольника: {площадь}")
print(f"Периметр прямоугольника: {периметр}")